read -sv *.v
hierarchy -top SystolicArray
proc; opt
techmap; opt
write_verilog SystolicArray_netlist.v