read -sv *.v
hierarchy -top FMA
proc; opt
techmap; opt
write_verilog FMA_netlist.v